/*
 * Домашнее задание.
 ** Циклы
 *** Задача 2. Необходимо вывести на экран числа от 5 до 1.
 *** При решении используйте операцию декремента (--).
 */

public class Decrement {

    public static void main(String[] args) {
        for (int i = 5; i >= 1; i--) {
            System.out.print(i + " ");
        }
    }

}
